<a href="https://colab.research.google.com/github/jproctor-rebecca/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment_RJProctor.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [26]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-08-05 21:26:45--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.96.14
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.96.14|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  15.1MB/s    in 14s

2020-08-05 21:27:00 (13.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [27]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [28]:
%cd instacart_2017_05_01
# change directories

/content/instacart_2017_05_01/instacart_2017_05_01

In [29]:
!ls -lh *.csv
# bash command 
# list out 
# long format
# human readable

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [30]:
import pandas as pd
import numpy as np

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [31]:
aisles = pd.read_csv('aisles.csv')

print(aisles.shape)
aisles

# do not need

(134, 2)

     aisle_id                       aisle
0           1       prepared soups salads
1           2           specialty cheeses
2           3         energy granola bars
3           4               instant foods
4           5  marinades meat preparation
..        ...                         ...
129       130    hot cereal pancake mixes
130       131                   dry pasta
131       132                      beauty
132       133  muscles joints pain relief
133       134  specialty wines champagnes

[134 rows x 2 columns]

In [32]:
departments = pd.read_csv('departments.csv')

print(departments.shape)
departments

# do not need

(21, 2)

    department_id       department
0               1           frozen
1               2            other
2               3           bakery
3               4          produce
4               5          alcohol
5               6    international
6               7        beverages
7               8             pets
8               9  dry goods pasta
9              10             bulk
10             11    personal care
11             12     meat seafood
12             13           pantry
13             14        breakfast
14             15     canned goods
15             16       dairy eggs
16             17        household
17             18           babies
18             19           snacks
19             20             deli
20             21          missing

In [33]:
order_products__prior = pd.read_csv('order_products__prior.csv')

print(order_products__prior.shape)
order_products__prior

# this data will not be used - see concatonated data below

(32434489, 4)

          order_id  product_id  add_to_cart_order  reordered
0                2       33120                  1          1
1                2       28985                  2          1
2                2        9327                  3          0
3                2       45918                  4          1
4                2       30035                  5          0
...            ...         ...                ...        ...
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

[32434489 rows x 4 columns]

In [34]:
order_products__train = pd.read_csv('order_products__train.csv')

print(order_products__train.shape)
order_products__train

# this data will not be used - see concatonated data below

(1384617, 4)

         order_id  product_id  add_to_cart_order  reordered
0               1       49302                  1          1
1               1       11109                  2          1
2               1       10246                  3          0
3               1       49683                  4          0
4               1       43633                  5          1
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[1384617 rows x 4 columns]

In [35]:
# concatonate order_products__train to order_products__prior
# name df to represent all products ordered (most recent and those prior to most recent)

# can drop reordered - need all others; index=product_id

order_products = pd.concat([order_products__prior, order_products__train])
order_products = order_products.drop('reordered', axis=1)

print(order_products.shape)
order_products

(33819106, 3)

         order_id  product_id  add_to_cart_order
0               2       33120                  1
1               2       28985                  2
2               2        9327                  3
3               2       45918                  4
4               2       30035                  5
...           ...         ...                ...
1384612   3421063       14233                  3
1384613   3421063       35548                  4
1384614   3421070       35951                  1
1384615   3421070       16953                  2
1384616   3421070        4724                  3

[33819106 rows x 3 columns]

In [36]:
# can drop aisle_id and department_id - need others; index=product_id

products = pd.read_csv('products.csv')
products = products.drop('aisle_id', axis=1)
products = products.drop('department_id', axis=1)

print(products.shape)
products

(49688, 2)

       product_id                                       product_name
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49683       49684          Vodka, Triple Distilled, Twist of Vanilla
49684       49685                 En Croute Roast Hazelnut Cranberry
49685       49686                                   Artisan Baguette
49686       49687         Smartblend Healthy Metabolism Dry Cat Food
49687       49688                             Fresh Foaming Cleanser

[49688 rows x 2 columns]

In [37]:
# can drop eval_set and days_since_prior_order - need others; index=order_id 

orders = pd.read_csv('orders.csv')
orders = orders.drop('eval_set', axis=1)
orders = orders.drop('days_since_prior_order', axis=1)

print(orders.shape)
orders

(3421083, 5)

         order_id  user_id  order_number  order_dow  order_hour_of_day
0         2539329        1             1          2                  8
1         2398795        1             2          3                  7
2          473747        1             3          3                 12
3         2254736        1             4          4                  7
4          431534        1             5          4                 15
...           ...      ...           ...        ...                ...
3421078   2266710   206209            10          5                 18
3421079   1854736   206209            11          4                 10
3421080    626363   206209            12          1                 12
3421081   2977660   206209            13          1                 12
3421082    272231   206209            14          6                 14

[3421083 rows x 5 columns]

In [38]:
# merge these into a single dataframe
# filter based on order_id to slim data
condition = (orders['user_id'] == 1) & (orders['order_number'] <=2)
orders_subset = orders[condition]

orders_subset

   order_id  user_id  order_number  order_dow  order_hour_of_day
0   2539329        1             1          2                  8
1   2398795        1             2          3                  7

In [39]:
condition = (order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)
order_products_subset = order_products[condition]

order_products_subset

          order_id  product_id  add_to_cart_order
22742744   2398795         196                  1
22742745   2398795       10258                  2
22742746   2398795       12427                  3
22742747   2398795       13176                  4
22742748   2398795       26088                  5
22742749   2398795       13032                  6
24076664   2539329         196                  1
24076665   2539329       14084                  2
24076666   2539329       12427                  3
24076667   2539329       26088                  4
24076668   2539329       26405                  5

In [40]:
# merge orders_subset and 
orders_and_products = pd.merge(orders_subset, order_products_subset, on='order_id')

orders_and_products

    order_id  user_id  ...  product_id  add_to_cart_order
0    2539329        1  ...         196                  1
1    2539329        1  ...       14084                  2
2    2539329        1  ...       12427                  3
3    2539329        1  ...       26088                  4
4    2539329        1  ...       26405                  5
5    2398795        1  ...         196                  1
6    2398795        1  ...       10258                  2
7    2398795        1  ...       12427                  3
8    2398795        1  ...       13176                  4
9    2398795        1  ...       26088                  5
10   2398795        1  ...       13032                  6

[11 rows x 7 columns]

In [45]:
# look for NaN and unique values
final.isnull().sum()

product_id           0
product_name         0
order_id             0
user_id              0
order_number         0
order_dow            0
order_hour_of_day    0
add_to_cart_order    0
dtype: int64

In [41]:
condition = products['product_id'].isin(orders_and_products['product_id'])
products_subset = products[condition]

products_subset

       product_id                             product_name
195           196                                     Soda
10257       10258                               Pistachios
12426       12427                      Original Beef Jerky
13031       13032                    Cinnamon Toast Crunch
13175       13176                   Bag of Organic Bananas
14083       14084  Organic Unsweetened Vanilla Almond Milk
26087       26088               Aged White Cheddar Popcorn
26404       26405         XL Pick-A-Size Paper Towel Rolls

In [42]:
products_subset = products_subset[['product_id', 'product_name']]

products_subset

       product_id                             product_name
195           196                                     Soda
10257       10258                               Pistachios
12426       12427                      Original Beef Jerky
13031       13032                    Cinnamon Toast Crunch
13175       13176                   Bag of Organic Bananas
14083       14084  Organic Unsweetened Vanilla Almond Milk
26087       26088               Aged White Cheddar Popcorn
26404       26405         XL Pick-A-Size Paper Towel Rolls

In [60]:
final = pd.merge(products_subset, orders_and_products, on='product_id', how='inner')
final

    product_id  ... add_to_cart_order
0          196  ...                 1
1          196  ...                 1
2        10258  ...                 2
3        12427  ...                 3
4        12427  ...                 3
5        13032  ...                 6
6        13176  ...                 4
7        14084  ...                 2
8        26088  ...                 4
9        26088  ...                 5
10       26405  ...                 5

[11 rows x 8 columns]

In [61]:
# use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products
# clean and sort data to retreive top 10 most frequently ordered products
# sort values


final.groupby(['product_id']).size().sort_values(ascending=False)

print(final.shape)
final

(11, 8)

    product_id  ... add_to_cart_order
0          196  ...                 1
1          196  ...                 1
2        10258  ...                 2
3        12427  ...                 3
4        12427  ...                 3
5        13032  ...                 6
6        13176  ...                 4
7        14084  ...                 2
8        26088  ...                 4
9        26088  ...                 5
10       26405  ...                 5

[11 rows x 8 columns]

In [62]:
# sort rows
final_cleaned = final.sort_values(by=['order_number', 'add_to_cart_order'], ascending=False)
final_cleaned

    product_id  ... add_to_cart_order
5        13032  ...                 6
9        26088  ...                 5
6        13176  ...                 4
4        12427  ...                 3
2        10258  ...                 2
1          196  ...                 1
10       26405  ...                 5
8        26088  ...                 4
3        12427  ...                 3
7        14084  ...                 2
0          196  ...                 1

[11 rows x 8 columns]

In [63]:
# reorder columns
final_cleaned = final[['user_id', 'order_id', 'order_number','order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]
final_cleaned

    user_id  order_id  ...  product_id                             product_name
0         1   2539329  ...         196                                     Soda
1         1   2398795  ...         196                                     Soda
2         1   2398795  ...       10258                               Pistachios
3         1   2539329  ...       12427                      Original Beef Jerky
4         1   2398795  ...       12427                      Original Beef Jerky
5         1   2398795  ...       13032                    Cinnamon Toast Crunch
6         1   2398795  ...       13176                   Bag of Organic Bananas
7         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
8         1   2539329  ...       26088               Aged White Cheddar Popcorn
9         1   2398795  ...       26088               Aged White Cheddar Popcorn
10        1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls

[11 rows x 8 columns]

In [103]:
# clean column
final_cleaned.columns = [columns.replace('_', ' ') for columns in final_cleaned]

final_cleaned

    user id  order id  ...  product id                             product name
0         1   2539329  ...         196                                     Soda
1         1   2398795  ...         196                                     Soda
2         1   2398795  ...       10258                               Pistachios
3         1   2539329  ...       12427                      Original Beef Jerky
4         1   2398795  ...       12427                      Original Beef Jerky
5         1   2398795  ...       13032                    Cinnamon Toast Crunch
6         1   2398795  ...       13176                   Bag of Organic Bananas
7         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
8         1   2539329  ...       26088               Aged White Cheddar Popcorn
9         1   2398795  ...       26088               Aged White Cheddar Popcorn
10        1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls

[11 rows x 8 columns]

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [69]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

#table2 = table1.T

table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [71]:
# table2 -> tidy
table1.T

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [104]:
# Take the row index, and add it as a new column
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [105]:
 # What is the unique identifier for each row
# Where is the data at that I want to be in my single "tidy" column

tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [106]:
# rename columns
# rename columns
tidy1 = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy1

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [107]:
tidy1.trt = tidy1.trt.str.replace('treatment', '')

tidy1

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [108]:
wide = tidy1.pivot_table(index='name', columns='trt', values='result')

wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [ ]:
# take table2 (the transpose of table1) and 
# reshape it to be in tidy data format using .melt() 
# then put it back in "wide format" using .pivot_table()

In [101]:
import seaborn as sns
import pandas as pd

flights = sns.load_dataset('flights')

In [99]:
print(flights.shape)
flights

(144, 3)

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [100]:
# Take the row index, and add it as a new column
# reset index to follow classtoom proceedure even though flights already had 
#   index column

# flights = flights.reset_index()
# flights

     index  year      month  passengers
0        0  1949    January         112
1        1  1949   February         118
2        2  1949      March         132
3        3  1949      April         129
4        4  1949        May         121
..     ...   ...        ...         ...
139    139  1960     August         606
140    140  1960  September         508
141    141  1960    October         461
142    142  1960   November         390
143    143  1960   December         432

[144 rows x 4 columns]

In [102]:
#flights.T - use melt() 
flights_T = flights.melt(id_vars='year', value_vars=['month', 'passengers'])
flights_T

     year    variable     value
0    1949       month   January
1    1949       month  February
2    1949       month     March
3    1949       month     April
4    1949       month       May
..    ...         ...       ...
283  1960  passengers       606
284  1960  passengers       508
285  1960  passengers       461
286  1960  passengers       390
287  1960  passengers       432

[288 rows x 3 columns]

In [90]:
# Flights Pivot Table
# index: unique identifier 
# columns: What do you want to differentiate the columns in wide format 
# values: Where are the numbers at - go in the middle of the wide dataframe
flights_pvt = flights.pivot_table(index='year', columns='month', values='passengers')
flights_pvt

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [109]:
##### YOUR CODE HERE #####

from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [111]:
##### YOUR CODE HERE #####
###still working on setup here###

products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

In [112]:
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

In [113]:
products.columns.to_list()

['product_id', 'product_name', 'aisle_id', 'department_id']

In [ ]:
# subset before you merge; add condition before merge
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

condition = merged['product_name'].isin(product_names)

subset = merged[condition]

print(subset.shape)
subset

In [ ]:
condition = ((merged['product_name']=='Half Baked Frozen Yogurt') | 
             (merged['product_name']=='Half And Half Ultra Pasteurized'))

subset = merged[condition]

print(subset.shape)
subset